Revit 2024 API
BuiltInFailures.JoinElementsFailures.CannotJoinDesignOptions Property
 An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotJoinDesignOptions { get; }
Visual Basic
Public Shared ReadOnly Property CannotJoinDesignOptions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotJoinDesignOptions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace